cf/Catalogs/нсиУниверсальныйФункциональныйСправочник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>нсиУниверсальныйФункциональныйСправочник</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.нсиВидыСправочников</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоМакет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПозиции</Name>
					<Comment>Эталон/Дубль/Одиночная позиция</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.нсиТипыПозицийСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭталоннаяПозиция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиУниверсальныйФункциональныйСправочник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписьНеНормализуема</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.нсиУниверсальныйКлассификатор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.нсиПризнакиИспользованияПозицийМТР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>пЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТехническиеХарактеристики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеХарактеристики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиНаименованияХарактеристикУниверсальногоСправочника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.нсиХарактеристикиУниверсальногоСправочника</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.нсиХарактеристикиУниверсальногоСправочника</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяКлассификация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидКлассификатора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиВидыДополнительныхКлассификаторов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.нсиДополнительныеКлассификаторы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf/Catalogs/нсиУниверсальныйФункциональныйСправочник/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////
// Выделение изменений

Функция СписокРеквизитовВыделенияИзменений() Экспорт
	Возврат Неопределено	
КонецФункции	

Функция СписокРеквизитовИсключенийВыделенияИзменений() Экспорт
	Возврат "Код,Наименование,ПолноеНаименование"
КонецФункции	

Функция НастройкиОформленияВыделенияИзмененийТабличныхЧастей() Экспорт
	
	Настройки_ТехническиеХарактеристики = Новый Структура;
	Настройки_ТехническиеХарактеристики.Вставить("КлючСтроки"     , "Характеристика");
	Настройки_ТехническиеХарактеристики.Вставить("Реквизиты"      , "Значение");
	Настройки_ТехническиеХарактеристики.Вставить("РеквизитФормы"  , "ТехническиеХарактеристикиФорма");
	Настройки_ТехническиеХарактеристики.Вставить("Элемент"        , "ТехническиеХарактеристикиФорма");
	
	Настройки_ДополнительнаяКлассификация = Новый Структура;
	Настройки_ДополнительнаяКлассификация.Вставить("КлючСтроки", "ВидКлассификатора,Класс");
	Настройки_ДополнительнаяКлассификация.Вставить("Реквизиты" , "");
	Настройки_ДополнительнаяКлассификация.Вставить("Элемент"   , "ДополнительнаяКлассификация");
	
	НастройкиОформления = Новый Структура;
	НастройкиОформления.Вставить("ТехническиеХарактеристики"     , Настройки_ТехническиеХарактеристики);
	НастройкиОформления.Вставить("ДополнительнаяКлассификация"   , Настройки_ДополнительнаяКлассификация);	
	
	Возврат НастройкиОформления
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытийМенеджераСправочника

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Данные.Владелец.РеквизитПредставления = Справочники.нсиПредопределенныеРеквизиты.Код Тогда 
		Представление = СокрЛП(Данные.Код);
	Иначе
		Представление = Данные.Наименование;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Код");
	Поля.Добавить("Наименование");
	Поля.Добавить("Владелец");
КонецПроцедуры

#КонецОбласти
